In [429]:
import pandas as pd
from pathlib import Path

In [430]:
path = Path ("../Pybank/budget_data.csv")
data = pd.read_csv(path)

In [431]:
data.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [432]:
data['Var'] = data_clean['Profit/Losses'].diff(1)
data.head()

       Date  Profit/Losses       Var
0  Jan-2010         867884       NaN
1  Feb-2010         984655  116771.0
2  Mar-2010         322013 -662642.0
3  Apr-2010         -69417 -391430.0
4  May-2010         310503  379920.0

In [433]:
data_clean = data.fillna(0.0)
data_clean.head()

       Date  Profit/Losses       Var
0  Jan-2010         867884       0.0
1  Feb-2010         984655  116771.0
2  Mar-2010         322013 -662642.0
3  Apr-2010         -69417 -391430.0
4  May-2010         310503  379920.0

In [434]:
Total_Months = data['Date'].count()
print (Total_Months)

86

In [435]:
Var_avg = data_clean['Var'].mean()
print (Var_avg)

-2288.1976744186045

In [437]:
data_clean['Var'].max()

1926159.0

In [438]:
data_clean['Var'].min()

-2196167.0